#########################################################
"""26 利用递归方法求5!"""
# tmp = 1
# for i in range(5):
#     tmp *= i+1
# print(tmp)
""" def digui(n):
    if n == 1:
        fn = 1
    else:
        fn = n*digui(n-1)
    return(fn)


print(digui(5)) """

#########################################################
"""27 利用递归函数调用方式，将所输入的5个字符，以相反顺序打印出来。"""
""" def output(s, l):
    if l==0:
        return
    print(s[l-1],end="")
    output(s,l-1)


s = input()
l = len(s)
output(s, l) """
#########################################################
"""28 有5个人坐在一起，
问第五个人多少岁？他说比第4个人大2岁。
问第4个人岁数，他说比第3个人大2岁。
问第三个人，又说比第2人大两岁。
问第2个人，说比第一个人大两岁。
最后问第一个人，他说是10岁。
请问第五个人多大？"""
""" def age(n):
    if n == 1:
        sui = 10
    else:
        sui = age(n-1)+2
    return(sui)


print(age(5)) """
#########################################################
"""29 给一个不多于5位的正整数，要求：
一、求它是几位数，
二、逆序打印出各位数字"""
# def output(s, l):
#     if l == 0:
#         return
#     print(s[l-1], end="")
#     output(s, l-1)


# s = input()
# l = len(s)
# print("是",l,"位数")
# output(s, l)
#########################################################
"""30 一个5位数，判断它是不是回文数。
即12321是回文数，个位与万位相同，十位与千位相同。"""
# s = input()
# l = len(s)
# if l == 5:
#     if s[0] == s[l-1] and s[1] == s[l-2]:
#         print("是回文")
#     else:
#         print("不是回文")
# else:
#     print("不是5位")

a = input("输入一串数字: ")
b = a[::-1]
if a == b:
    print("%s 是回文" % a)
else:
    print("%s 不是回文" % a)
