#########################################################
"""52 学习使用按位或 |
0|0=0; 0|1=1; 1|0=1; 1|1=1"""
a = 0o77
b = a | 3
print('a | b is %d' % b)
b |= 7
print('a | b is %d' % b)

#########################################################
"""53 学习使用按位异或 ^
0^0=0; 0^1=1; 1^0=1; 1^1=0"""
a = 0o77
b = a ^ 3
print('The a ^ 3 = %d' % b)
b ^= 7
print('The a ^ b = %d' % b)
#########################################################
"""54 取一个整数a从右端开始的4〜7位
(1)先使a右移4位。
(2)设置一个低4位全为1,其余全为0的数。可用~(~0<<4)
(3)将上面二者进行&运算。"""
a = int(input('input a number:\n'))
b = a >> 4
print(b)
c = ~(~0 << 4)
print(c)
d = b & c
print(d)
print('%o\t%o' % (a, d))
#########################################################
"""55 学习使用按位取反~
二进制数在内存中以补码的形式存储。
按位取反：二进制每一位取反，0 变 1，1 变 0。
最高位为符号位，正数的符号位为 0，负数为 1。
对正数来说，最高位为 0，其余各位代表数值本身(以二进制表示)，如 +42 的补码为 00101010。
对负数而言，把该数绝对值的补码按位取反，然后对整个数加 1，即得该数的补码。如 -42 的补码为 11010110(00101010 按位取反
11010101+1 即 11010110)。
~9 的计算步骤：
转二进制：0 1001
计算补码：0 1001
按位取反：1 0110
转为原码：
按位取反：1 1001
末位加 1：1 1010
符号位为 1 是负数，即 -10"""


a = 7
b = ~a
c = -7
d = ~c
print ('变量 a 取反结果为： %d' % b)
print ('变量 c 取反结果为： %d' % d)


#########################################################
"""56 画图，学用circle画圆形"""

from _typeshed import Self
import turtle
turtle.title("画圆")
turtle.setup(800, 600, 0, 0)
pen = turtle.Turtle()
pen.color("yellow")
pen.width(5)
pen.shape("turtle")
pen.speed(1)
pen.circle(100)

#########################################################
from tkinter import *
 
canvas = Canvas(width=800, height=600, bg='yellow')
canvas.pack(expand=YES, fill=BOTH)
k = 1
j = 1
for i in range(0,26):
    canvas.create_oval(310 - k,250 - k,310 + k,250 + k, width=1)
    k += j
    j += 0.3
mainloop()

#########################################################
"""57 画图，学用line画直线"""
import turtle

def drawline(n):
    t=turtle.Pen()
    t.color(0.3,0.8,0.6)  #设置颜色，在0--1之间
    t.begin_fill()   #开始填充颜色
    for i in range(n): #任意边形
        t.forward(50)
        t.left(360/n)
    t.end_fill()    #结束填充颜色

drawline(4)
#########################################################
"""58 画图，学用rectangle画方形"""
import turtle

def drawline(n):
    t=turtle.Pen()
    t.color(0.3,0.8,0.6)  #设置颜色，在0--1之间
    t.begin_fill()   #开始填充颜色
    for i in range(n): #任意边形
        t.forward(50)
        t.left(360/n)
    t.end_fill()    #结束填充颜色

drawline(4)
#########################################################
"""59 利用for循环控制100-999个数，每个数分解出个位，十位，百位"""
#########################################################
"""60 计算字符串长度"""

string = input()
len11 = string.__len__()
print(len(string))
print(len11)