#########################################################
"""81 
809*??=800*??+9*?? 
其中??代表的两位数, 809*??为四位数，8*??的结果为两位数，9*??的结果为3位数。
求??代表的两位数，及809*??后的结果"""
# for i in range(10, 100):
#     if 809*i > 1000 and 809*i < 10000 and 8*i > 10 and 8*i < 100 and 9*i > 100 and 9 * i < 1000 and 809 * i == 800 * i + 9 * i:
#         print("??代表的两位数",i)
#         print("809*??后的结果",i*809)
#########################################################
"""82 
八进制转换为十进制"""
# if __name__ == '__main__':
#     n = 0
#     p = input('input a octal number:\n')
#     for i in range(len(p)):
#         n = n * 8 + ord(p[i]) - ord('0')
#     print (n)
#########################################################
"""83 
求0—7所能组成的奇数个数。
程序分析：
组成1位数是4个。
组成2位数是7*4个。
组成3位数是7*8*4个。
组成4位数是7*8*8*4个。
"""
# def f(n):
#     if n == 0:
#         return 1
#     elif n == 1:
#         return 7
#     else:
#         return f(n-1)*8
# l = []
# #算出每位数有多少奇数
# for i in range(1,9):
#     l.append(f(i-1)*4)
# print(l)
# #输出一共有多少个奇数
# print(sum(l))

""" if __name__ == '__main__':
    sum = 4
    s = 4
    for j in range(2,9):
        print (sum)
        if j <= 2:
            s *= 7
        else:
            s *= 8
        sum += s
    print ('sum = %d' % sum) """

#########################################################
"""84 连接字符串
"""
# delimiter = ','
# mylist = ['Brazil', 'Russia', 'India', 'China']
# print (delimiter.join(mylist))

#########################################################
"""85 输入一个奇数，然后判断最少几个 9 除于该数的结果为整数
"""
# if __name__ == "__main__":
#     i = int(input('input a number:'))
#     sum = 9
#     while sum % i != 0:
#         sum = sum * 10 + 9

#     print (sum)
#########################################################
"""86 两个字符串连接程序
"""
# a = "acegikm"
# b = "bdfhjlnpq"

# # 连接字符串
# c = a + b
# print(c)
#########################################################
"""87 
回答结果（结构体变量传递）
"""
# if __name__ == '__main__':
#     class student:
#         x = 0
#         c = 0
#     def f(stu):
#         stu.x = 20
#         stu.c = 'c'
#     a= student()
#     a.x = 3
#     a.c = 'a'
#     f(a)
#     print (a.x,a.c)
#########################################################
"""88 
读取7个数（1—50）的整数值，每读取一个值，程序打印出该值个数的＊
"""
# if __name__ == '__main__':
#     n = 1
#     while n <= 7:
#         a = int(input('input a number:\n'))
#         while a < 1 or a > 50:
#             a = int(input('input a number:\n'))
#         print (a * '*')
#         n += 1
#########################################################
"""89 
某个公司采用公用电话传递数据，数据是四位的整数，
在传递过程中是加密的，加密规则如下：
每位数字都加上5,然后用和除以10的余数代替该数字，
再将第一位和第四位交换，第二位和第三位交换
"""
# num = int(input("请输入一个四位整数:"))
# num = str(num)
# List = []
# for i in range(0, len(num)):
#     a = (int(num[i])+5) % 10
#     List.append(a)
# List[0], List[3] = List[3], List[0]
# List[1], List[2] = List[2], List[1]
# print(List[0]*1000+List[1]*100+List[2]*10+List[3])
#########################################################
"""90 
列表使用实例
"""